# 02 - Explore Data

Libraries have pre-defined code for other functions that are not included in basic Python. Once a library has been imported, any of its functions can be used throughout the entire notebook.

In [23]:
#import libraries
import pandas as pd
import numpy as np

## Load data

### csv files

Stands for "comma separated values"; it is a plain text file where each value is separated by some delimiter (usually commas but can be tabs, semicolons, spaces, etc.)

In [24]:
#load csv file data with headers

location = "datasets/smallgradesh.csv"
df = pd.read_csv(location)

In [26]:
df.shape

(2000, 2)

In [3]:
df.head()
#df.head?

      Name  Grade
0   Marcia   82.4
1   Kadeem   78.2
2     Nash   79.3
3  Noelani   83.2
4  Noelani   87.4

In [4]:
df.tail(3)

          Name  Grade
1997  Mercedes   84.9
1998    Lucius   69.1
1999     Linus   79.6

In [6]:
#load data without headers

location2 = "datasets/smallgrades.csv"
df_nohead = pd.read_csv(location2, header=None) #try w/o header=None
df_nohead.head()

         0     1
0   Marcia  82.4
1   Kadeem  78.2
2     Nash  79.3
3  Noelani  83.2
4  Noelani  87.4

In [15]:
#add headers during data load

df_during = pd.read_csv(location2, names=['Name', 'Grade'])
df_during.head()

      Name  Grade
0   Marcia   82.4
1   Kadeem   78.2
2     Nash   79.3
3  Noelani   83.2
4  Noelani   87.4

In [7]:
#add headers after data load

df_nohead.columns = ['Name', 'Grade']
df_nohead.head()

      Name  Grade
0   Marcia   82.4
1   Kadeem   78.2
2     Nash   79.3
3  Noelani   83.2
4  Noelani   87.4

In [16]:
#create data

names = ['Bob','Jessica','Mary','John','Mel']
grades = [76,95,77,78,99]
GradeList = list(zip(names,grades))

In [17]:
#export csv files

df = pd.DataFrame(data = GradeList, columns=['Names','Grades'])
df.to_csv('studentgrades.csv',index=False,header=False)

### Your Turn
1) Can you make a dataframe from a file you have uploaded and
imported on your own? Let’s find out. Go to the census website
(http://census.ire.org/data/bulkdata.html) and download the csv datafile
for a state. Now try to import that data into python.

2) Can you export the dataframe created by the following code to csv?
Creating a dataset for the exercise

In [ ]:
import pandas as pd

names = ['Bob','Jessica','Mary','John','Mel']
grades = [76,95,77,78,99]
bsdegrees = [1,1,0,0,1]
msdegrees = [2,1,0,0,0]
phddegrees = [0,1,0,0,0]

Degrees = zip(names,grades,bsdegrees,msdegrees,phddegrees)
columns=['Names','Grades','BS','MS','PhD']
df = pd.DataFrame(data = Degrees, columns=column)
df

### Excel files

In [56]:
#import Excel file

location = "datasets/gradedata.xlsx"
df = pd.read_excel(location) #overwrites the info from the df variable in the examples above
df.head()

,fname,lname,gender,age,exercise,hours,grade,address
0,Marcia,Pugh,female,17,3,10,82.4,"7379 Highland Rd. , Dublin, GA 31021"
1,Kadeem,Morrison,male,18,4,4,78.2,"8 Bayport St. , Honolulu, HI 96815"
2,Nash,Powell,male,18,5,9,79.3,"Encino, CA 91316, 3 Lilac Street"
3,Noelani,Wagner,female,14,2,7,83.2,"Riverview, FL 33569, 9998 North Smith Dr."
4,Noelani,Cherry,female,18,4,15,87.4,"97 SE. Ocean Street , Bethlehem, PA 18015"

In [57]:
#save dataframe as Excel file

#using GradeList from above
names = ['Bob','Jessica','Mary','John','Mel']
grades = [76,95,77,78,99]
GradeList = list(zip(names,grades))

df = pd.DataFrame(data = GradeList, columns=['Names','Grades'])
writer = pd.ExcelWriter('dataframe.xlsx', engine='xlsxwriter')
df.to_excel(writer, sheet_name='Sheet1')
writer.save()

In [58]:
#multiple sheets

df = pd.DataFrame(data = GradeList, columns=['Names','Grades'])
writer = pd.ExcelWriter('dataframe.xlsx', engine='xlsxwriter')
df.to_excel(writer, sheet_name='Sheet1')
df.to_excel(writer, sheet_name='Sheet2')
writer.save()

### Your Turn
1) Can you make a dataframe from a file you have uploaded
and imported on your own? Let’s find out. Go to this website
(https://www.census.gov/support/USACdataDownloads.html) and
download one of the excel datafiles at the bottom of the page. Now try to
import that data into python.

2) Can you export the dataframe created by the following code to excel? Creating a dataset for the exercise

In [30]:
location1 = "downloads/maryland.csv"
df = pd.read_csv(location1)

In [59]:
df = pd.DataFrame(data = location1), columns=['Names','Grades'])
writer = pd.ExcelWriter('dataframe.xlsx', engine='xlsxwriter')
df.to_excel(writer, sheet_name='Sheet1')
writer.save()

ValueError: DataFrame constructor not properly called!

In [31]:
df.shape

(24, 15)

In [32]:
df.head()

,GEOID,SUMLEV,STATE,COUNTY,CBSA,CSA,NECTA,CNECTA,NAME,POP100,HU100,POP100.2000,HU100.2000,P001001,P001001.2000
0,24001,50,24,1,19060,999,NaN,NaN,Allegany County,75087,33311,74930,32984,75087,74930
1,24003,50,24,3,12580,548,NaN,NaN,Anne Arundel County,537656,212562,489656,186937,537656,489656
2,24005,50,24,5,12580,548,NaN,NaN,Baltimore County,805029,335622,754292,313734,805029,754292
3,24009,50,24,9,47900,548,NaN,NaN,Calvert County,88737,33780,74563,27576,88737,74563
4,24011,50,24,11,99999,999,NaN,NaN,Caroline County,33066,13482,29772,12028,33066,29772

In [33]:
df.tail()

,GEOID,SUMLEV,STATE,COUNTY,CBSA,CSA,NECTA,CNECTA,NAME,POP100,HU100,POP100.2000,HU100.2000,P001001,P001001.2000
19,24041,50,24,41,20660,999,NaN,NaN,Talbot County,37782,19577,33812,16500,37782,33812
20,24043,50,24,43,25180,999,NaN,NaN,Washington County,147430,60814,131923,52972,147430,131923
21,24045,50,24,45,41540,480,NaN,NaN,Wicomico County,98733,41192,84644,34401,98733,84644
22,24047,50,24,47,36180,480,NaN,NaN,Worcester County,51454,55749,46543,47360,51454,46543
23,24510,50,24,510,12580,548,NaN,NaN,Baltimore city,620961,296685,651154,300477,620961,651154

In [35]:
df.columns

Index(['GEOID', 'SUMLEV', 'STATE', 'COUNTY', 'CBSA', 'CSA', 'NECTA', 'CNECTA',
       'NAME', 'POP100', 'HU100', 'POP100.2000', 'HU100.2000', 'P001001',
       'P001001.2000'],
      dtype='object')

In [37]:
df.dtypes

GEOID             int64
SUMLEV            int64
STATE             int64
COUNTY            int64
CBSA              int64
CSA               int64
NECTA           float64
CNECTA          float64
NAME             object
POP100            int64
HU100             int64
POP100.2000       int64
HU100.2000        int64
P001001           int64
P001001.2000      int64
dtype: object

In [55]:
import pandas as pd
names = ['Nike','Adidas','New Balance','Puma','Reebok']
prices = [176,59,47,38,99]
PriceList = zip(names,prices)
df = pd.DataFrame(data = PriceList, columns=('names','prices'))

TypeError: data argument can't be an iterator

### Exploratory Analysis

In [ ]:
#load gradedata.csv file

location = "datasets/gradedata.csv"
df = pd.read_csv(location)

df.head()

In [ ]:
#show the column names in the dataset
df.columns
#or print(df.columns)

In [ ]:
#show the data type of each column
df.dtypes

In [ ]:
#number of non-NA values
#len(df) would count rows including NA values
df.count()

In [ ]:
df['hours'].max()

In [ ]:
df['hours'].min()

In [ ]:
df['hours'].sum()

In [ ]:
df['hours'].mean()

In [ ]:
df['hours'].median()

In [ ]:
df['hours'].mode()

In [ ]:
df['hours'].value_counts()

In [ ]:
#standard deviation
df['hours'].std()

In [ ]:
#descriptive statistics
df.describe()

In [ ]:
#doesn't do anything on its own
df.groupby('gender')

In [ ]:
#add a stats or math function to it
df['hours'].groupby(df['gender']).mean()

#mean of multiple columns
#df[['hours', 'exercise']].groupby(df['gender']).mean()

In [ ]:
#use two columns to groupby
df.groupby(['gender', 'age']).mean()

In [ ]:
#pivot table default function is mean
pd.pivot_table(df, index=['gender'])

In [ ]:
pd.pivot_table(df, values=['hours'], index=['gender'])

In [ ]:
#unique values in a column
df['age'].unique()

In [ ]:
#find missing values
filename = "datasets/gradedatamissing.csv"
df_missing = pd.read_csv(filename)

#df.head()

In [ ]:
#total missing values
df_missing.isnull().sum()

In [ ]:
#show rows with missing values
missing = df_missing['exercise'].isnull()
#missing will only show True/False values
df_missing.loc[missing]

### Your Turn
1) Take a look at datasets\dvddata.xlsx and do some exploratory analysis.

## Finding duplicate rows

In [ ]:
names = ['Jessica','John','Bob','Jessica','Mary','John','Mel','Mel']
grades = [95,78,76,95,77,78,99,100]
GradeList = list(zip(names,grades))
df = pd.DataFrame(data = GradeList, columns=['Names', 'Grades'])
df

In [ ]:
#boolean values for if there's another row with the exact values in each column
dupe = df.duplicated()
#duplicate of Jessica, 95; John, 78
#returns false on first instance of duplicate row

In [ ]:
df.loc[dupe]

### Your Turn
1) Load the dataset datasets/dupedata.csv. We figure people with the same
address are duplicates. Can you drop the duplicated rows while keeping
the first?

## Choosing Rows

In [ ]:
colA = [10, 20, 40, 50]
colB = ['no', 'yes', 'yes', 'no']

A_B = list(zip(colA, colB))

df_A = pd.DataFrame(data=A_B, columns=['A', 'B'])
df_A

In [ ]:
index = ['a', 'b', 'c', 'd']
colA = [10, 20, 40, 50]
colB = ['no', 'yes', 'yes', 'no']

df_B = pd.DataFrame(data=A_B, columns=['A', 'B'], index=index)

df_B

In [ ]:
#loc: label based indexing
df_A.loc[0]

In [ ]:
#iloc: select row by index(position) number
df_A.iloc[0]

In [ ]:
#loc: label based indexing
df_B.loc['b']

In [ ]:
df_B.iloc[1]

In [ ]:
#let's see how it gets tricky
df_C = df_A.copy()
df_C

In [ ]:
index = [2,1,0,3]
colA = [10, 20, 40, 50]
colB = ['no', 'yes', 'yes', 'no']

df_D = pd.DataFrame(data=A_B, columns=['A', 'B'], index=index)
df_D

In [ ]:
#works like python slicing; give me index 0 through the index before 3
df_C.iloc[0:3]

In [ ]:
#give me the index label '0' and everything in between and include the label '3'
df_C.loc[0:3]

In [ ]:
#gave index position 0 through the index position before 3
df_D.iloc[0:3]

In [ ]:
#gave the label '0' and all the rows that are in between and ending with the row with label '3'
df_D.loc[0:3]

# Bonus Code!

Below are some code snippets for advanced tasks

## SQL

In [ ]:
from sqlalchemy import create_engine

# Connect to sqlite db
db_file = r'datasets/gradedata.db'
engine = create_engine(r"sqlite:///{}".format(db_file))

sql = "SELECT * FROM test;"
sales_data_df = pd.read_sql(sql, engine)
sales_data_df

In [ ]:
#find table names
sql = "SELECT name FROM sqlite_master WHERE type = 'table';"

In [ ]:
#query with conditional
sql = 'SELECT * FROM test WHERE Grades IN (76,77,78)'

## Load multiple data files

In [ ]:
import glob

all_data = pd.DataFrame()
for f in glob.glob("datasets/data*.xlsx"):
    df = pd.read_excel(f)
    all_data = all_data.append(df, ignore_index=True)
    
all_data.count() #each data file had 100 rows

### Your Turn
1) In the datasets/weekly_call_data folder, there are 104 files of weekly call
data for 2 years. Your task is to try to load all of that data into one data
frame.

## Create random data

In [ ]:
from numpy import random

names = ['Bob','Jessica','Mary','John','Mel']

random.seed(500)

random_names = [names[random.randint(low=0,high=len(names))] 
 				for i in range(1000)]

births = [random.randint(low=0,high=1000) 
 		  for i in range(1000)]

BabyDataSet = list(zip(random_names,births))
df = pd.DataFrame(data = BabyDataSet, columns=['Names', 'Births'])

df.head()

### Your Turn
1) Create a dataframe called parkingtickets with 250 rows containing a name
and a number between 1 and 25.